# FilterDialog Methods

---
The FilterDialog type exposes the following members.
| Name| Description
---|---|---
| Dispose|
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| Show|  Shows the FilterDialog editing dialog to the user.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
FilterDialog Class
Autodesk.Revit.UI Namespace